"""

Объявите в программе следующий список с числами просмотров видео по дням:
v = [1205, 1101, 1434, 1320, 923, 874]
Выберите из списка v первые три значения (используя срезы) и выведите этот срез как список на экран.
v = [1205, 1101, 1434, 1320, 923, 874]
print(v[0:3])


lst = ["Москва", "Уфа", "Тверь", "Казань"]
lst1 = lst[1:3] # ['Уфа', 'Тверь']
lst2 = lst[2:] # ['Тверь', 'Казань']
lst3 = lst[:3] # ['Москва', 'Уфа', 'Тверь']
cities = lst[:] # ['Москва', 'Уфа', 'Тверь', 'Казань'] копия lst
lst4 = lst[-1] # Казань
marks = [2, 3, 4, 3, 5, 2]
marks1 = marks[2:-1] # [4, 3, 5]
marks2 = marks[-3:-1] # [3, 5]
marks3 = marks[1:5:2] # [3, 3]
marks4 = marks[1::2] # [3, 3, 2]
marks5 = marks[::2] # [2, 4, 5]
marks6 = marks[::-1] # [2, 5, 3, 4, 3, 2] все элементы, начиная с последнего инверсия списка как реверс
marks7 = marks[::-2] # [2, 3, 3] идем с последнего элемента к началу через один
marks = [2, 3, 4, 3, 5, 2]
marks[2:4] = ["good", "notgood"]
print(marks)

Подвиг 2. Объявите в программе следующий список с числами просмотров видео по дням:
v = [1205, 1101, 1434, 1320, 923, 874]
Выберите из него последние четыре значения (используя срезы) и выведите этот срез как список на экран.
v = [1205, 1101, 1434, 1320, 923, 874]
print(v[2:])



Объявите в программе следующий список с названиями городов:
c = ["Москва", "Ульяновск", "Самара", "Тверь", "Вологда", "Омск", "Уфа"]
С помощью срезов выберите из этого списка города через один (начиная с первого города) и результат (срез) выведите на экран в виде полученного списка.



"""

c = ["Москва", "Ульяновск", "Самара", "Тверь", "Вологда", "Омск", "Уфа"]




































