"""
line = [1, 7, 6, 11, 3]
img = [[1, 7, 6, 11, 3], [1, 7, 6, 11, 3], [1, 7, 6, 11, 3], [1, 7, 6, 11, 3], [1, 7, 6, 11, 3]]
# [1, 7, 6, 11, 3] [1, 7, 6, 11, 3] [1, 7, 6, 11, 3] [1, 7, 6, 11, 3] [1, 7, 6, 11, 3]
img1 = [line[:], line[:], line[:], line[:], line[:]]
# [1, 7, 6, 11, 3] [1, 7, 6, 11, 3] [1, 7, 6, 11, 3] [1, 7, 6, 11, 3] [1, 7, 6, 11, 3]
img2 = img[0][1]  # 7

img[1] = [0, 0, 0, 0, 0]  # [1, 7, 6, 11, 3] [0, 0, 0, 0, 0] [1, 7, 6, 11, 3] [1, 7, 6, 11, 3] [1, 7, 6, 11, 3]
img[1][:] = [1] * 5  # [1, 7, 6, 11, 3] [1, 1, 1, 1, 1] [1, 7, 6, 11, 3] [1, 7, 6, 11, 3] [1, 7, 6, 11, 3]

t = [["Люблю", "тебя", "Петра", "творенье"],
     ["Люблю", "твой", "строгий", "стройный", "вид"],
     ["Невы", "державное", "теченье"],
     ["Береговой", "ее", "гранит"]
     ]
# [['Люблю', 'тебя', 'Петра', 'творенье'], ['Люблю', 'твой', 'строгий', 'стройный', 'вид'], ['Невы', 'державное', 'теченье'], ['Береговой', 'ее', 'гранит']]
t[0]  # ['Люблю', 'тебя', 'Петра', 'творенье']
t[0][2]  # Петра
t[0][2] = "Python"  # ['Люблю', 'тебя', 'Python', 'творенье']
t.append(["Твоих", "оград", "узор", "чугунный"])  # ДОБАВЛЯЕМ ЭЛЕМЕНТ В СПИСОК
# [['Люблю', 'тебя', 'Python', 'творенье'], ['Люблю', 'твой', 'строгий', 'стройный', 'вид'], ['Невы', 'державное', 'теченье'], ['Береговой', 'ее', 'гранит'], ['Твоих', 'оград', 'узор', 'чугунный']]
del t[1]  # удаляем второй элемент списка
# [['Люблю', 'тебя', 'Python', 'творенье'], ['Невы', 'державное', 'теченье'], ['Береговой', 'ее', 'гранит'], ['Твоих', 'оград', 'узор', 'чугунный']]

A = [[[True, False], [1, 2, 3]], ["matrix", "vector"]]  # [[[True, False], [1, 2, 3]], ['matrix', 'vector']]
A[0]# [[True, False], [1, 2, 3]]
print(A[1]) # ['matrix', 'vector']
print(A[0][0][1]) # False
print(A[1][0]) # matrix
print(t)



"""






































