"""
q,w,e = map(int, input().split())
Если необходимо считать значение в виде строки, используйте следующий вариант:
переменная = input()
✅   Если необходимо считать значение в виде целого числа, используйте следующий вариант:
переменная = int(input())
✅   Если необходимо считать значение в виде вещественного числа, используйте следующий вариант:
переменная = float(input())
✅  Если необходимо считать несколько целых чисел, вводимых через пробел в одной строке, используйте следующий вариант:
переменная_1, переменная_2, ..., переменная_N = map(int, input().split())
✅  Если необходимо считать несколько вещественных чисел, вводимых через пробел в одной строке, используйте следующий вариант:
переменная_1, переменная_2, ..., переменная_N = map(float, input().split())
   ✅  Если необходимо считать значения в виде строк и каждое слово сохранить в отдельную переменную,  используйте следующий вариант:

переменная_1, переменная_2, ..., переменная_N = input().split()


"""
















