"""
Переменные chest1 и chest2 уже созданы и в них присвоены целые числа и мы не знаем какие. Создайте 4 переменные с математическими операциями между chest1 и chest2:

result1 равную сумме chest1 и chest2.
result2 равную разности chest1 и chest2.
result3 равную умножению chest1 и chest2.
result4 равную делению chest1 и chest2.
Комментарий: Выводить на экран с помощью print() ничего не нужно. Создайте 4 переменные, с именами как в задании и каждую на отдельной строке.
result1 = chest1 + chest2
result2 = chest1 - chest2
result3 = chest1 * chest2
result4 = chest1 / chest2


Алон, словно орешки щёлкает разгадывая загадки "Магии чисел" 🧙. Вот следующая загадка: "Чётные сверху, нечётные снизу, все больше нуля и меньше 10". Алон понял, что нужно вывести числа на двух строках. Сверху чётные, а снизу нечётные, от 1 до 9 включительно.
Задание:
Выведите две строки с числами на экран, чтобы результат выглядел вот так:
2 4 6 8
1 3 5 7 9
Sample Input:
Sample Output:
2 4 6 8
1 3 5 7 9
print(2, 4, 6, 8)
print(1, 3, 5, 7, 9)


print(1)
print(1, 1)
print(1, 1, 1)
print(1, 1)
print(1)


radius_of_my_wheel = 30
average_speed_of_my_car = 140
this_number_is_very_big_but_i_love_it = 1234567890987654321
print(radius_of_my_wheel, average_speed_of_my_car, this_number_is_very_big_but_i_love_it)


Создайте переменную balance со значением 789.
Переприсвойте значение переменной balance, добавив к её текущему значению число 567.
Переприсвойте значение переменной balance, вычитая из её текущего значения число 456.
Выведите на экран значение переменной balance, с помощью print.

balance = 789
balance += 567
balance -= 456
print(balance)




r, g, b и присвойте им значения: 255, 100, 0 соответственно. Это аббревиатура RGB (Red, Green, Blue).
- age, weight, height (возраст, вес, рост) и присвойте: 24, 70, 175 соответственно.
- line_length, radius, diagonal (длина линии, радиус, диагональ) и присвойте: 15, 60, 120 соответственно.
- len_of_car, len_of_sofa, len_of_carpet (длина машины, длина дивана, длина ковра), у этих трёх переменных будут одинаковые значения: 1.37
Выведите на экран переменные в таком порядке на одной строке: r, g, b, age, weight, height, line_length, radius, diagonal, len_of_car, len_of_sofa, len_of_carpet.
Комментарий:
Решите эту задачу так, как вам удобно, но помните о разных способах присвоения и о читаемости кода. Помните, что объекты внутри скобок в print можно переносить для улучшения читаемости.

Sample Input:

Sample Output:

255 100 0 24 70 175 15 60 120 1.37 1.37 1.37
"""
r, g, b = 255, 100, 0
age, weight, height = 24, 70, 175
line_length, radius, diagonal = 15, 60, 120
len_of_car = len_of_sofa = len_of_carpet = 1.37
print(r, g, b, age, weight, height, line_length, radius, diagonal, len_of_car, len_of_sofa, len_of_carpet)
