"""
bot_response = "Спасибо за вопрос. В ближайшее время с вами свяжется наш сотрудник и поможет вам."
print(bot_response)

print("Здравствуй, друг!", "Пишу тебе письмо,", "Используя одну строку кода!", sep="\n")


print("Друг,", end=" ")
print("смотри", end=" ")
print("как я могу!")

print(\"""
Развиваться в чём-то - это как идти в гору по скользкой дорожке.
Даже, чтобы просто устоять - нужно прикладывать усилия.
А для того чтобы идти вверх - нужно ещё больше усилий.
Деградация - это путь вниз с горы по скользкой дорожке.
Чтобы деградировать - достаточно просто расслабиться и скатиться вниз.
Будьте мудрыми, прикладывайте усилия!
\"""
)

text = (
"Дорогой друг! Сегодня я осознал одну вещь: в программировании всегда есть возможность решить задачу "
"разными способами. Это словно разные дороги, ведущие к одному и тому же пункту назначения. Где-то эта дорога "
"прямая и короткая, а где-то извилистая и долгая."
)
print(text)

print(
    'Привет, меня зовут Алон Миск, я живу "в ваших сердцах".\n'
    "Hello, my name is Alon Misk, and I live 'in your hearts'.\n"
    r"C:\Users\new_project\googlik"
)



"""
message1 = input()
print(message1)
message2 = input()
print(message2)











































































































