# print('я в жизни всякого повидал')
#
# print('Кот Василий, где ты был?')
# print('Я мышей ловить ходил...')
# print('Почему же ты в сметане?')
# print('Потому что был в чулане...')

# print("""Травку овечка на поле жевала
# Было ей скучно, травы было мало
#
# - Мне бы в саду пожевать винограда...
# И, размечтавшись, отбилась от стада.
# """)

# print("""2
#
# 32
# """)
#
# print(1, sep="-")
# print(1, sep="+", end="5")


print("Раз", "два", "три", "четыре", sep=", ")
print("Сосчитаем", "дыры в сыре", end=".")
# print("Если в сыре много дыр")
print("Значит", "вкусным", "будет", "сыр", sep=" ", end="\n\n")
# print("Если в нем одна дыра", end=",")
print("Значит", end=", ")
print("вкусным", "был", "вчера")