
"""

d = [1, 2, 3, 4, 5, 6, 7, 8, 9]

for x in d:
    print(x)
# 1
# 2
# 3
# 4
# 5
# 6
# 7
# 8
# 9


for x in 'python':
    print(x)
# p
# y
# t
# h
# o
# n


d = [1, 2, 3, 4, 5]
p = 1

for x in d:
    p *= x

print(d)
print(p)

d = [1, 2, 3, 4, 5]
for i in [0, 1, 2, 3, 4]:
    d[i] = 0
print(d)



n = int(input())

for _ in range(n):
    ticket = input().strip()
    if 'A' in ticket:
        print(ticket)

"""


print(*range(11))





















"""
for i in range(3):
    print(i, end=", ")


num = int(input())
for i in range(1, num + 1):
    print(i, end="\n")



num = int(input())
for i in range(2, num + 1, 2):
    print(i, end="\n")


num = int(input())

if num < 1:
    print(0)
else:
    total = 0
    for i in range(1, num + 1):
        total += i
    print(total)




Задача 4. Проверка билетов: буква A
📜 История:
На железнодорожной станции нужно быстро отфильтровать номера билетов: только те, в которых встречается заглавная латинская буква A, проходят проверку.

🎯 Задание:
Считай с клавиатуры число --> количество билетов.
Затем считай указанное количество строк --> номера билетов.
Выведи только те номера, в которых встречается заглавная буква A, каждый на новой строке.
🧪 Пример ввода:
5
abc4
Abc4
cdf5
LOL8
gAj9

🧪 Пример вывода:
Abc4
gAj9

Нажмите, чтобы увидеть тестовые данные
Sample Input:
5
abc4
Abc4
cdf5
LOL8
gAj9
Sample Output:
Abc4
gAj9


"""

















