"""
t = 10
if 0<= t<= 15:
    print("it\'s cold")


num = int(input())
if num == 1:
    print("Вы вошли в комнату с огнедышащим драконом. Дракон вас съел!")
elif num == 2:
    print('Вы упали в яму с крокодилами. Крокодилы с вами разобрались.')
elif num == 3:
    print('Вы вошли в комнату с гигантским холодильником и замёрзли, как мороженое.')
else:
    print('Вы нашли тайный выход! Побег удался!')



str1 = input().lower()
if str1 == 'комедия':
    print(f"Мы рекомендуем посмотреть фильм: 'Дублёр'.")
elif str1 == 'боевик':
    print(f"Мы рекомендуем посмотреть фильм: 'Миссия невыполнима'.")
elif str1 == 'драма':
    print(f"Мы рекомендуем посмотреть фильм: 'Зелёная миля'.")
else:
    print(f"Такого жанра нет. Попробуйте ещё раз.")

num = int(input())
if num == 1:
    print('Очень плохо')
elif num == 2:
    print('Неудовлетворительно')
elif num == 3:
    print('Удовлетворительно')
elif num == 4:
    print('Хорошо')
elif num == 5:
    print('Отлично')
else:
    print('Ошибка: оценка должна быть от 1 до 5.')

num = int(input())
if num > 0:
    print('Положительное число')
elif num == 0:
    print('Число равно нулю')
else:
    print('Отрицательное число')




"""


























