"""
x = 0
y = 5
print(not x or y > 10 and y < 20) # True


print(not (False or True and False)) # True

Считай с клавиатуры три значения:
здоровье (целое число),
ответ «да»/«нет» о наличии оружия,
ответ «да»/«нет» о наличии брони.

Считай, что здоровье > 50 --> хорошее состояние.
Считай «да» как наличие, «нет» как отсутствие.
Выведи ровно одно сообщение по правилам:
«Готов к сражению!», если здоровье > 50 и есть хотя бы одно: оружие или броня.
«Не стоит сражаться без экипировки!», если здоровье > 50, но нет ни оружия, ни брони.
«Не готов к сражению!», если здоровье ≤ 50 и нет ни оружия, ни брони.
«Не стоит рисковать!», если здоровье ≤ 50 и есть только одно: оружие или броня.
«Не стоит рисковать, но у тебя есть все шансы выжить!», если здоровье ≤ 50 и есть и оружие, и броня.
🧪 Пример ввода:
50
нет
нет

🧪 Пример вывода:

Не готов к сражению!

неверно



# Запрашиваем у пользователя данные
health = int(input())
has_weapon = input().lower() == "да"
has_armor = input().lower() == "да"

if health > 50:
    if has_weapon or has_armor:
        print('Готов к сражению!')
    else:
        print('Не стоит сражаться без экипировки!')
else:
    if not has_weapon and not has_armor:
        print('Не готов к сражению!')
    elif has_weapon and has_armor:
        print('Не стоит рисковать, но у тебя есть все шансы выжить!')
    else:
        print('Не стоит рисковать!')




health = int(input())
weapons = input()
armor = input()

if health > 50 and (weapons == 'да'  or armor == 'да'):
    print('Готов к сражению!')
elif health > 50 and (weapons == 'нет'  and armor == 'нет'):
    print('Не стоит сражаться без экипировки!')
elif health <= 50 and not (weapons == 'да' or armor == 'да'):
    print('Не готов к сражению!')
elif health <= 50 and (weapons == 'да'  or armor == 'да'):
    print('Не стоит рисковать!')
elif health <= 50 and (weapons == 'да' and armor == 'да'):
    print('Не стоит рисковать, но у тебя есть все шансы выжить!')


health = int(input())
has_weapon = input().lower() == "да"
has_armor = input().lower() == "да"

if health > 50 and (has_weapon or has_armor):
    print('Готов к сражению!')
elif health > 50 and (not has_weapon and not has_armor):
    print('Не стоит сражаться без экипировки!')
elif health <= 50 and (not has_weapon and not has_armor):
    print('Не готов к сражению!')
elif health <= 50 and has_weapon and has_armor:
    print('Не стоит рисковать!')
elif health <= 50 and (has_weapon and has_armor):
    print('Не стоит рисковать, но у тебя есть все шансы выжить!')



"""


















