"""
x = 0
y = 5
print(not x or y > 10 and y < 20) # True


print(not (False or True and False)) # True

Считай с клавиатуры три значения:
здоровье (целое число),
ответ «да»/«нет» о наличии оружия,
ответ «да»/«нет» о наличии брони.

Считай, что здоровье > 50 --> хорошее состояние.
Считай «да» как наличие, «нет» как отсутствие.
Выведи ровно одно сообщение по правилам:
«Готов к сражению!», если здоровье > 50 и есть хотя бы одно: оружие или броня.
«Не стоит сражаться без экипировки!», если здоровье > 50, но нет ни оружия, ни брони.
«Не готов к сражению!», если здоровье ≤ 50 и нет ни оружия, ни брони.
«Не стоит рисковать!», если здоровье ≤ 50 и есть только одно: оружие или броня.
«Не стоит рисковать, но у тебя есть все шансы выжить!», если здоровье ≤ 50 и есть и оружие, и броня.
🧪 Пример ввода:
50
нет
нет

🧪 Пример вывода:

Не готов к сражению!

неверно



# Запрашиваем у пользователя данные
health = int(input())
has_weapon = input().lower() == "да"
has_armor = input().lower() == "да"

if health > 50:
    if has_weapon or has_armor:
        print('Готов к сражению!')
    else:
        print('Не стоит сражаться без экипировки!')
else:
    if not has_weapon and not has_armor:
        print('Не готов к сражению!')
    elif has_weapon and has_armor:
        print('Не стоит рисковать, но у тебя есть все шансы выжить!')
    else:
        print('Не стоит рисковать!')




health = int(input())
weapons = input()
armor = input()

if health > 50 and (weapons == 'да'  or armor == 'да'):
    print('Готов к сражению!')
elif health > 50 and (weapons == 'нет'  and armor == 'нет'):
    print('Не стоит сражаться без экипировки!')
elif health <= 50 and not (weapons == 'да' or armor == 'да'):
    print('Не готов к сражению!')
elif health <= 50 and (weapons == 'да'  or armor == 'да'):
    print('Не стоит рисковать!')
elif health <= 50 and (weapons == 'да' and armor == 'да'):
    print('Не стоит рисковать, но у тебя есть все шансы выжить!')


health = int(input())
has_weapon = input().lower() == "да"
has_armor = input().lower() == "да"

if health > 50 and (has_weapon or has_armor):
    print('Готов к сражению!')
elif health > 50 and (not has_weapon and not has_armor):
    print('Не стоит сражаться без экипировки!')
elif health <= 50 and (not has_weapon and not has_armor):
    print('Не готов к сражению!')
elif health <= 50 and has_weapon and has_armor:
    print('Не стоит рисковать!')
elif health <= 50 and (has_weapon and has_armor):
    print('Не стоит рисковать, но у тебя есть все шансы выжить!')

health = int(input())
mana = int(input())
has_item = input().strip().lower() == "да"

if (health >= 50 and mana > 0) or (health <= 50 and has_item):
    print('Герой готов к битве!')
else:
    print('Герой не готов к битве!')


rose = int(input())
tulpe = int(input())
lily = int(input())

if rose > 10 and tulpe > 0:
    print('Нельзя добавить тюльпаны, если роз больше 10!')
elif rose > 5 and lily >= 1:
    print('Нельзя добавить больше 5 роз, если в букете есть лилии!')
elif (rose + tulpe + lily ) < 3:
    print('Букет слишком мал, добавьте больше цветов!')
else:
    print('Букет собран!')




rating = int(input())
genre = input()
film_duration = int(input())

if (rating >=7)  and (genre == 'боевик' or genre == 'комедия') and (film_duration <= 120):
    print('Фильм подходит для просмотра!')
else:
    print('Фильм не подходит для просмотра!')


rating = int(input())
theme = input()
l = int(input())

if (rating >= 7) and (theme == 'космос' or theme == 'электромобили' or theme == 'искусственный интеллект') and (l <= 100):
    print('Вопрос принят!')
else:
    print('Вопрос отклонен!')

soldier = int(input())
weapons = int(input())
morale = int(input())

if soldier < 500:
    print('Недостаточно солдат!')
elif weapons * 2 < soldier:
    print('Недостаточно оружия!')
elif morale >= 70 or soldier > 1000:
    print('Армия готова к битве!')
else:
    print('Низкая мораль армии!')



children = int(input())
box = int(input())
suit = int(input())

if box >= children and suit >= 3:
    print('Праздник состоится!')
elif box < children:
    print('Не хватает подарков!')
elif suit <= 3:
    print('Недостаточно костюмов снегурочек!')



age = int(input())
statu = input().strip().lower()
rating = int(input())
in_IT = input().strip().lower() == 'да'
invite = input().strip().lower() == 'да'

if age < 18:
    print('Недостаточный возраст')
elif not statu == 'разработчик' and not statu == 'дизайнер':
    print('Неверный профессиональный статус')
elif invite:
    print('Доступ разрешен')
elif rating > 80:
    print('Доступ разрешен')
elif(50 <= rating <= 80) and in_IT:
    print('Доступ разрешен')
else :
    print('Недостаточный рейтинг')

"""



















































