# q = int(input())
# print(len(q))


"""
Напиши программу, которая:
Принимает список очков игроков (целые числа), этот код уже реализован. Списки мы будем проходить позднее.
Вычисляет:
Общее количество очков (sum)
Максимальное количество очков (max)
Минимальное количество очков (min)
Выводит три числа через пробел:
Сумма очков
Максимальное значение
Минимальное значение
💡 Подсказка: В уроке по функциям sum(), max() и min() есть похожие примеры.
Sample Input:
100 250 150 400
Sample Output:
900 400 100

scores = list(map(int, input().split()))
print(sum(scores), max(scores), min(scores))

st = input()
print(len(st))

name = input().split()
print(len(name))


scores = list(map(int, input().split()))
print(max(scores), min(scores), sep="\n")

cost = list(map(int, input().split()))
print(sum(cost))

q = input()
u = input()
print(len(q) + len(u))

data_type = input()
print(type(data_type))
"""



























