"""
num1 = int(input())
num2 = int(input())

if num1 > num2:
    print(num1 > num2)


Задание:
Пользователь пишет сообщение, поэтому создайте переменную и примите это сообщение.
Создайте проверку, является ли сообщение словом start. Если является, выведите на экран текст:
Запускаю программу, если не является, то ничего выводить не нужно.
Ваша задача, принять строку от пользователя и сделать проверку.
"""





























